In [10]:
import numpy as np
import pandas as pd

df = pd.read_csv('messy_data.csv')

df.head()

,StudentID,Name,Age,Gender,Math_Score,Science_Score,Attendance_Percent
0,101,John,20.0,M,85.0,90.0,95.0
1,102,Alice,19.0,F,88.0,NaN,92.0
2,103,Bob,21.0,M,78.0,85.0,88.0
3,104,Eve,NaN,F,92.0,89.0,96.0
4,105,Charlie,20.0,M,85.0,90.0,95.0

In [13]:
# Fill the missing data instead of delete

fill_data = df.fillna({'Age': df['Age'].mean(), 'Science_Score': df['Science_Score'].mean(), 'Math_Score': df['Math_Score'].mean(), 'Attendance_Percent': df['Attendance_Percent'].mean()} )

fill_data

,StudentID,Name,Age,Gender,Math_Score,Science_Score,Attendance_Percent
0,101,John,20.000000,M,85.000000,90.000000,95.0
1,102,Alice,19.000000,F,88.000000,85.545455,92.0
2,103,Bob,21.000000,M,78.000000,85.000000,88.0
3,104,Eve,20.090909,F,92.000000,89.000000,96.0
4,105,Charlie,20.000000,M,85.000000,90.000000,95.0
5,101,John,20.000000,M,85.000000,90.000000,95.0
6,106,David,22.000000,M,85.272727,76.000000,85.0
7,107,Sarah,19.000000,F,91.000000,93.000000,91.0
8,108,Mike,21.000000,M,73.000000,70.000000,80.0
9,109,Lisa,20.000000,F,88.000000,84.000000,90.0
10,110,Anna,19.000000,F,88.000000,84.000000,90.0
11,105,Charlie,20.000000,M,85.000000,90.000000,95.0

In [16]:
# Delete the duplicate rows

orig_rows = fill_data.drop_duplicates()

orig_rows

,StudentID,Name,Age,Gender,Math_Score,Science_Score,Attendance_Percent
0,101,John,20.000000,M,85.000000,90.000000,95.0
1,102,Alice,19.000000,F,88.000000,85.545455,92.0
2,103,Bob,21.000000,M,78.000000,85.000000,88.0
3,104,Eve,20.090909,F,92.000000,89.000000,96.0
4,105,Charlie,20.000000,M,85.000000,90.000000,95.0
6,106,David,22.000000,M,85.272727,76.000000,85.0
7,107,Sarah,19.000000,F,91.000000,93.000000,91.0
8,108,Mike,21.000000,M,73.000000,70.000000,80.0
9,109,Lisa,20.000000,F,88.000000,84.000000,90.0
10,110,Anna,19.000000,F,88.000000,84.000000,90.0

In [19]:
# instead of float convert to integer

int_conv = orig_rows.astype({'Age': 'int32', 'Math_Score': 'int32', 'Science_Score': 'int32', 'Attendance_Percent': 'int32'})

int_conv

,StudentID,Name,Age,Gender,Math_Score,Science_Score,Attendance_Percent
0,101,John,20,M,85,90,95
1,102,Alice,19,F,88,85,92
2,103,Bob,21,M,78,85,88
3,104,Eve,20,F,92,89,96
4,105,Charlie,20,M,85,90,95
6,106,David,22,M,85,76,85
7,107,Sarah,19,F,91,93,91
8,108,Mike,21,M,73,70,80
9,109,Lisa,20,F,88,84,90
10,110,Anna,19,F,88,84,90

In [23]:
# center the text

pd.set_option('display.colheader_justify', 'center')
print(int_conv.to_string(justify='center'))

    StudentID   Name    Age Gender  Math_Score  Science_Score  Attendance_Percent
0      101        John  20     M        85           90                95
1      102       Alice  19     F        88           85                92
2      103         Bob  21     M        78           85                88
3      104         Eve  20     F        92           89                96
4      105     Charlie  20     M        85           90                95
6      106       David  22     M        85           76                85
7      107       Sarah  19     F        91           93                91
8      108        Mike  21     M        73           70                80
9      109        Lisa  20     F        88           84                90
10     110        Anna  19     F        88           84                90